## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 4 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                RESOURCE                                 |
|--------|-------------------------------------------------------------------------|
| add    | `aws_iam_policy.superset_athena_read[&quot;all&quot;]`                            |
|        | `aws_iam_role.superset_athena_read[&quot;all&quot;]`                              |
|        | `aws_iam_role_policy_attachment.superset_athena_read[&quot;all&quot;]`            |
| update | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;celery-beat&quot;]`   |
|        | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;celery-worker&quot;]` |
|        | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;superset&quot;]`      |
|        | `aws_iam_role.superset_athena_read[&quot;operations_aws_production&quot;]`        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["celery-beat"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id             = "celery-beat-error"
        name           = "celery-beat-error"
      ~ pattern        = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*SYNTAX_ERROR*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*SYNTAX_ERROR*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["celery-worker"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id             = "celery-worker-error"
        name           = "celery-worker-error"
      ~ pattern        = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*SYNTAX_ERROR*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*SYNTAX_ERROR*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["superset"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id             = "superset-error"
        name           = "superset-error"
      ~ pattern        = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*SYNTAX_ERROR*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*SYNTAX_ERROR*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.superset_athena_read["all"] will be created
  + resource "aws_iam_policy" "superset_athena_read" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "SupersetAthenaRead-all"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "athena:GetDataCatalog"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production"
                      + Sid      = "AthenaDataCatalogAccess"
                    },
                  + {
                      + Action   = [
                          + "athena:StopQueryExecution",
                          + "athena:StartQueryExecution",
                          + "athena:ListWorkGroups",
                          + "athena:ListTagsForResource",
                          + "athena:ListTableMetadata",
                          + "athena:ListQueryExecutions",
                          + "athena:ListNamedQueries",
                          + "athena:ListDatabases",
                          + "athena:ListDataCatalogs",
                          + "athena:GetWorkGroup",
                          + "athena:GetTableMetadata",
                          + "athena:GetQueryResultsStream",
                          + "athena:GetQueryResults",
                          + "athena:GetQueryExecution",
                          + "athena:GetPreparedStatement",
                          + "athena:GetNamedQuery",
                          + "athena:DeletePreparedStatement",
                          + "athena:CreatePreparedStatement",
                          + "athena:BatchGetQueryExecution",
                          + "athena:BatchGetNamedQuery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AthenaRead"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-data-lake-transformed-production/*",
                          + "arn:aws:s3:::cds-data-lake-transformed-production",
                          + "arn:aws:s3:::cds-data-lake-curated-production/*",
                          + "arn:aws:s3:::cds-data-lake-curated-production",
                        ]
                      + Sid      = "S3AthenaSourceBucketRead"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-data-lake-athena-production/*",
                          + "arn:aws:s3:::cds-data-lake-athena-production",
                        ]
                      + Sid      = "S3AthenaResultBucketWrite"
                    },
                  + {
                      + Action   = [
                          + "glue:GetTables",
                          + "glue:GetTableVersions",
                          + "glue:GetTableVersion",
                          + "glue:GetTable",
                          + "glue:GetPartitions",
                          + "glue:GetPartition",
                          + "glue:GetDatabases",
                          + "glue:GetDatabase",
                          + "glue:BatchGetPartition",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:glue:ca-central-1:739275439843:table/*/*",
                          + "arn:aws:glue:ca-central-1:739275439843:database/*",
                          + "arn:aws:glue:ca-central-1:739275439843:catalog",
                          + "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production",
                        ]
                      + Sid      = "GlueRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.superset_athena_read["all"] will be created
  + resource "aws_iam_role" "superset_athena_read" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::066023111852:role/superset_ecs_task_role"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "This role allows the Superset ECS task to read from all Glue databases"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SupersetAthenaRead-all"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.superset_athena_read["operations_aws_production"] will be updated in-place
  ~ resource "aws_iam_role" "superset_athena_read" {
      ~ description           = "This role allows the Superset ECS task to read from Athena's Glue catalog operations_aws_production database" -> "This role allows the Superset ECS task to read from the operations_aws_production Glue database"
        id                    = "SupersetAthenaRead-operations_aws_production"
        name                  = "SupersetAthenaRead-operations_aws_production"
        tags                  = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.superset_athena_read["all"] will be created
  + resource "aws_iam_role_policy_attachment" "superset_athena_read" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SupersetAthenaRead-all"
    }

Plan: 3 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
